# Data cleansing

During the course of doing data analysis and modeling, a significant amount of time is spent on data preparation:

*   loading
*   cleaning
*   transforming
*   rearraging

Such tasks are often reported to take up 80% or more of an analyst’s time.

What can happen with the loading data are
* missing data
* duplicate data
* string manipulation
* other analytical data transformation

## Missing data
---

Some data are imperfect, but it is functional for lot of users

For numeric data,
  Pandas use Nan ``` Nan``` (Not a Number) to represent the number

So call a *sentinel value*

**To detect the missing data**

---


Check by `isNull` value

```python
import pandas as pd
import numpy as np
```



```python
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
```

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

check for null value

```python
string_data.isnull()
```

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

The N/A handling method are provided in the data frame as given

![image-20230906053837943](./assets/image-20230906053837943.png)

### Filtering the data
---


The *NA* data can filtering out as shown

```python
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data
```

In [4]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

The `dropna` method will filter out the NA value

```python
data.dropna()
```

In [5]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

the data frame can be also filter

```python
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data
```

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

The `dropna` method will drop all the rows which contains NA value


```python
cleaned = data.dropna()
cleaned
```

In [7]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

**We** can drop only the line which contains **NA** all the rows usign `how='all'`

```python
data.dropna(how='all')
```

In [8]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

**To** drop only columns which contains  all NA, you can use the `axis=1 `parameter

```python
data.dropna(how='all',axis=1)
```

In [11]:
data.dropna(how='all',axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Try to add a new column with NA value
```python
data[4] = NA
data
```

In [12]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

drop na regarding to the axis
```python
data.dropna(axis=1, how='all')
```

In [13]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

Comparing to
```python
data.dropna(axis=1)
```

In [14]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

What are differents of `how='all'` and no `how` parameter

We can drop the rows which may have more data than the given value as we can tolerate for some data missing. `tresh` parameter is required here
```python
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df
```

In [15]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.453542       NaN       NaN
1  1.006891       NaN       NaN
2  0.495600       NaN -0.617985
3 -0.316107       NaN -0.434032
4 -0.736880 -1.479965 -0.662663
5 -0.305211 -1.370165 -0.648707
6  0.230736  0.630379  2.388448

drop all NA
```python
df.dropna()
```

In [16]:
df.dropna()

          0         1         2
4 -0.736880 -1.479965 -0.662663
5 -0.305211 -1.370165 -0.648707
6  0.230736  0.630379  2.388448

drop only a line which contains non-NA value more than or equal than the treshold
```python
df.dropna(thresh=2)
```

In [17]:
df.dropna(thresh=2)

          0         1         2
2  0.495600       NaN -0.617985
3 -0.316107       NaN -0.434032
4 -0.736880 -1.479965 -0.662663
5 -0.305211 -1.370165 -0.648707
6  0.230736  0.630379  2.388448

#### Work



Form the file given in `file/property_data.csv`

Provide the given output

In [18]:
import pandas as pd

In [19]:
dat =pd.read_csv('file/property_data.csv')
dat

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

output 1
![image-20230906061553156](./assets/image-20230906061553156.png)

In [20]:
dat.isnull().sum()

PID             1
ST_NUM          2
ST_NAME         0
OWN_OCCUPIED    1
NUM_BEDROOMS    2
NUM_BATH        1
SQ_FT           1
PRICE           8
dtype: int64

In [21]:
dat.dropna()

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0

Output 2

![image-20230906061619935](./assets/image-20230906061619935.png)

In [22]:
tresh_percent =0.75
req_thres = (len(df.columns)*tresh_percent)
dat.dropna(thresh=req_thres)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

In [23]:
dat.dropna(thresh=6)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

Output 3

![image-20230906061652010](./assets/image-20230906061652010.png)

In [24]:
dat['NUM_BATH'].isnull()

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8    False
Name: NUM_BATH, dtype: bool

In [25]:
dat.dropna(thresh=8,axis=1)

           PID     ST_NAME OWN_OCCUPIED NUM_BATH SQ_FT
0  100001000.0      PUTNAM            Y        1  1000
1  100002000.0   LEXINGTON            N      1.5    --
2  100003000.0   LEXINGTON            N        1   850
3  100004000.0    BERKELEY           12      NaN   700
4          NaN    BERKELEY            Y        2  1600
5  100006000.0    BERKELEY            Y        1   800
6  100007000.0  WASHINGTON          NaN   HURLEY   950
7  100008000.0     TREMONT            Y        1   NaN
8  100009000.0     TREMONT            Y        2  1800

### Filling in missing data
---
Instead of filtering data. Default data may be used.
we can fil the default data for all `NA` values.

```python
df
```

In [26]:
df

          0         1         2
0 -0.453542       NaN       NaN
1  1.006891       NaN       NaN
2  0.495600       NaN -0.617985
3 -0.316107       NaN -0.434032
4 -0.736880 -1.479965 -0.662663
5 -0.305211 -1.370165 -0.648707
6  0.230736  0.630379  2.388448

```python
df.fillna(0)
```

In [27]:
df.fillna(0)

          0         1         2
0 -0.453542  0.000000  0.000000
1  1.006891  0.000000  0.000000
2  0.495600  0.000000 -0.617985
3 -0.316107  0.000000 -0.434032
4 -0.736880 -1.479965 -0.662663
5 -0.305211 -1.370165 -0.648707
6  0.230736  0.630379  2.388448

Or we can define the value for each column
```python
df.fillna({"PID":0.5,"ST_NUM":1.2})
```

In [28]:
df.fillna({"PID":0.5,"ST_NUM":1.2})

          0         1         2
0 -0.453542       NaN       NaN
1  1.006891       NaN       NaN
2  0.495600       NaN -0.617985
3 -0.316107       NaN -0.434032
4 -0.736880 -1.479965 -0.662663
5 -0.305211 -1.370165 -0.648707
6  0.230736  0.630379  2.388448

In [30]:
dfna = df.fillna({"PID":0.5,"ST_NUM":1.2})

In [31]:
dfna

          0         1         2
0 -0.453542       NaN       NaN
1  1.006891       NaN       NaN
2  0.495600       NaN -0.617985
3 -0.316107       NaN -0.434032
4 -0.736880 -1.479965 -0.662663
5 -0.305211 -1.370165 -0.648707
6  0.230736  0.630379  2.388448

`fillna` returns a new object, but we can modify the existing object in-place
```python
df.fillna(0,inplace=True)
df
```

In [32]:
df.fillna(0,inplace=True)
df

          0         1         2
0 -0.453542  0.000000  0.000000
1  1.006891  0.000000  0.000000
2  0.495600  0.000000 -0.617985
3 -0.316107  0.000000 -0.434032
4 -0.736880 -1.479965 -0.662663
5 -0.305211 -1.370165 -0.648707
6  0.230736  0.630379  2.388448

We can use the interpolation method to file the value.

Now we create a new data frame with some `NA`
```python
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
```

In [33]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.781937  1.138246 -0.168261
1  2.307719  0.273456  0.535663
2  1.513986       NaN -0.484301
3  1.406587       NaN -0.561482
4 -0.057031       NaN       NaN
5 -1.216304       NaN       NaN

Add the interpolation methods for more details google `dataframe fillna`
```python
df.fill()
```

In [36]:
df.ffill()

          0         1         2
0 -0.781937  1.138246 -0.168261
1  2.307719  0.273456  0.535663
2  1.513986  0.273456 -0.484301
3  1.406587  0.273456 -0.561482
4 -0.057031  0.273456 -0.561482
5 -1.216304  0.273456 -0.561482

we can set limit of filling data that it should not be filled more than limit value.
```python
df.ffill(limit=2)
```

In [37]:
df.ffill(limit=2)

          0         1         2
0 -0.781937  1.138246 -0.168261
1  2.307719  0.273456  0.535663
2  1.513986  0.273456 -0.484301
3  1.406587  0.273456 -0.561482
4 -0.057031       NaN -0.561482
5 -1.216304       NaN -0.561482

Another fill method can be found in the api
such as `bfill` which is backward fill
```python
df.bfill()
```

In [38]:
df.bfill()

          0         1         2
0 -0.781937  1.138246 -0.168261
1  2.307719  0.273456  0.535663
2  1.513986       NaN -0.484301
3  1.406587       NaN -0.561482
4 -0.057031       NaN       NaN
5 -1.216304       NaN       NaN

Try

```python
df[6] = [1,2,3]
df
```

In [39]:
df[6] = [1,2,3]
df

ValueError: Length of values (3) does not match length of index (6)

#### Work

---
From the propery_data you have done from the last work
Provide this dataframe

In [40]:
import pandas as pd

dat2 = pd.read_csv('file/property_data.csv')
dat2

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

Output 1
![image-20230906063035319](./assets/image-20230906063035319.png)

In [41]:
dat2.fillna(-1)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,-1.0
2,100003000.0,-1.0,LEXINGTON,N,-1,1,850,-1.0
3,100004000.0,201.0,BERKELEY,12,1,-1,700,-1.0
4,-1.0,203.0,BERKELEY,Y,3,2,1600,-1.0
5,100006000.0,207.0,BERKELEY,Y,-1,1,800,-1.0
6,100007000.0,-1.0,WASHINGTON,-1,2,HURLEY,950,-1.0
7,100008000.0,213.0,TREMONT,Y,1,1,-1,-1.0
8,100009000.0,215.0,TREMONT,Y,na,2,1800,-1.0

In [42]:
dat2.ffill()

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,20000.0
2,100003000.0,197.0,LEXINGTON,N,3,1,850,20000.0
3,100004000.0,201.0,BERKELEY,12,1,1,700,20000.0
4,100004000.0,203.0,BERKELEY,Y,3,2,1600,20000.0
5,100006000.0,207.0,BERKELEY,Y,3,1,800,20000.0
6,100007000.0,207.0,WASHINGTON,Y,2,HURLEY,950,20000.0
7,100008000.0,213.0,TREMONT,Y,1,1,950,20000.0
8,100009000.0,215.0,TREMONT,Y,na,2,1800,20000.0

Output 2
![image-20230906063122466](./assets/image-20230906063122466.png)

Output 3
![image-20230906063412850](./assets/image-20230906063412850.png)

In [43]:
dat2['PID'].ffill (inplace=True)
dat2['ST_NUM'].ffill (inplace=True)
dat2['OWN_OCCUPIED']. fillna ('N' , inplace=True)
dat2['NUM_BEDROOMS' ].fillna(0, inplace=True)
dat2['NUM_BATH']. fillna(0, inplace=True)
dat2['SQ_FT'].fillna (-1, inplace=True)
dat2['PRICE'].fillna (0, inplace=True)

In [44]:
dat2

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,0.0
2,100003000.0,197.0,LEXINGTON,N,0,1,850,0.0
3,100004000.0,201.0,BERKELEY,12,1,0,700,0.0
4,100004000.0,203.0,BERKELEY,Y,3,2,1600,0.0
5,100006000.0,207.0,BERKELEY,Y,0,1,800,0.0
6,100007000.0,207.0,WASHINGTON,N,2,HURLEY,950,0.0
7,100008000.0,213.0,TREMONT,Y,1,1,-1,0.0
8,100009000.0,215.0,TREMONT,Y,na,2,1800,0.0

## Data Transformation

We need to transform the data in the format which can manipulate it later.

### Removing Duplicates


Some data duplication must be removed to reduce the unusual behaviour of data
from the provided data

setting up a new dataframe
```python
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data
```

In [45]:

data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

The duplicated data is found by

```python
data.duplicated()
```

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

So we can drop the duplicate code
```python
data.drop_duplicates()
```

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

we can select key to check the duplicate data, adding a new column to the data frame to see which data is stored
```python
data['v1'] = range(7)
data
```

In [48]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

now check for duplicatoin
```python
data.duplicated()
```

In [49]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

check the dupplicate key only the key in column k1
```python
data.duplicated(['k1'])
```

In [50]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

The previous work keep the first data in the result data frame. We can keep the last entry of the duplicate data using the `keep` parameter
comparing these code?
```python
data.drop_duplicates(['k1','k2'])
```

In [51]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

with
```python
data.drop_duplicates(['k1','k2'],keep='last')
```

In [52]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or mapping

Data can be mapped to a better representation

with the provided data frame
```python
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data
```

In [53]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

The mapping dictionary is provided
```python
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
```

In [54]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

Then we can provide the map as given
```python
lowercased = data['food'].str.lower()
lowercased
```

In [55]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

then mapping the data
```python
data['animal'] = lowercased.map(meat_to_animal)
data
```

In [56]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing value
---

Some value can be replaced, in order to manage the code easier.
For example with the given data frame
```python
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data
```

In [57]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

The value -999 may be the **sentinel** values

The sentinel value is the value which define the state of data but not the real data. For example, the exit point or the `NA` of the value.
```python
data.replace(-999, np.nan)
```

In [58]:
import numpy as np

In [59]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

we can replace multiple data with only one value

```python
data.replace([-999,-1000],np.nan)
```

In [60]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

Or replace different value with different data
```python
data.replace([-999,-1000],[np.nan,0])
```

In [61]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

or using the dictionary to map the request data
```python
data.replace({-999: np.nan, -1000: 0})
```

In [62]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Index

The axis index which we loaded from the different sources may be hard to understand.
So we rename the index name for the better understanding
```python
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data
```

In [63]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

We can use the function to change the name of each index
```python
transform = lambda x: x[:4].upper()
new_data_index = data.index.map(transform)
```

In [64]:
transform = lambda x: x[:4].upper()
new_data_index = data.index.map(transform)

To change the index name we have to set the index values
```python
data.index = new_data_index
data
```

In [65]:
data.index = new_data_index
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

Or if we want to rename it instancely (without seeing the new solution first)  we can use the `rename` method
```python
data.rename(index=str.title, columns=str.upper)
```

In [66]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

if we want to change the specific name, using the map for change the index name
```python
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})
```

In [67]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

To save the new name directly using `inplace` method
```python
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data
```

In [68]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

#### Work
---

From the previous work provide this output

Output1

fill PID, and PID as an index
![image-20230906065515528](./assets/image-20230906065515528.png)

In [123]:
import pandas as pd
import numpy as np

dat3 = pd.read_csv('file/property_data.csv')
dat3

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

In [124]:
dat3['PID'] = dat3['PID'].replace(np.nan,100005000)

In [125]:
dat3

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,100005000.0,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

In [127]:
dat3.index = dat3['PID']

In [128]:
dat3

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
PID,,,,,,,,
100001000.0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
100002000.0,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
100003000.0,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
100004000.0,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
100005000.0,100005000.0,203.0,BERKELEY,Y,3,2,1600,NaN
100006000.0,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
100007000.0,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
100008000.0,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
100009000.0,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

Output2
Change the column name to your language
![image-20230906065658172](./assets/image-20230906065658172.png)

In [129]:

dat3.rename(columns={'PID':'รหัสบ้าน','ST_NUM':'เลขที่บ้าน','ST_NAME':'ชื่อถนน','OWN_OCCUPIED':'เจ้าของบ้าน',
                     'NUM_BEDROOMS':'จำนวนห้องนอน','NUM_BATH':'จำนวนห้องน้ำ','SQ_FT':'พื้นที่ใช้สอย','PRICE':'ราคาบ้าน'},inplace=True)
dat3

,รหัสบ้าน,เลขที่บ้าน,ชื่อถนน,เจ้าของบ้าน,จำนวนห้องนอน,จำนวนห้องน้ำ,พื้นที่ใช้สอย,ราคาบ้าน
PID,,,,,,,,
100001000.0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
100002000.0,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
100003000.0,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
100004000.0,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
100005000.0,100005000.0,203.0,BERKELEY,Y,3,2,1600,NaN
100006000.0,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
100007000.0,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
100008000.0,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
100009000.0,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

### Discretization and Bining
---

Extract data and put it in the bins for analysis

The bin is the range of the data that we want to analyze
create a list as
```python
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
```

In [88]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Then we create a bin
```python
bins = [18, 25, 35, 60, 100]
```

In [89]:
bins = [18, 25, 35, 60, 100]

Then we cut the data in to a bin, the cuts represent the bins for each data
```python
cuts = pd.cut(ages, bins)
cuts
```

In [90]:
cuts = pd.cut(ages, bins)
cuts

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

Instead of using the texts we can see the code (index) of each bins
```python
cuts.codes
```

In [91]:
cuts.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

and the catagories, and the amount of value in each cuts can be shown
```python
cuts.categories
```

In [92]:
cuts.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

We can count the amount of value in each cuts by using `value_counts` method
```python
pd.value_counts(cuts)
```

In [93]:
pd.value_counts(cuts)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

We can set the name of each cuts by passing the arrays of labels
```python
group_names = ['Youth', 'YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)
```

In [94]:
group_names = ['Youth', 'YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

If we pass the integer number instead of the bin edge, it will compute the equal-length bins based on the minimum and maximum values.
```python
data = np.random.rand(20)
pd.cut(data,4,precision=2)
```

In [95]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.73, 0.96], (0.25, 0.49], (0.0074, 0.25], (0.0074, 0.25], (0.49, 0.73], ..., (0.49, 0.73], (0.73, 0.96], (0.73, 0.96], (0.73, 0.96], (0.49, 0.73]]
Length: 20
Categories (4, interval[float64, right]): [(0.0074, 0.25] < (0.25, 0.49] < (0.49, 0.73] < (0.73, 0.96]]

Try counting the value of data
```python
pd.value_counts(pd.cut(data,4,precision=2))
```

In [96]:
pd.value_counts(pd.cut(data,4,precision=2))

(0.73, 0.96]      8
(0.49, 0.73]      6
(0.0074, 0.25]    4
(0.25, 0.49]      2
Name: count, dtype: int64

### Detecting and Filtering Outliers
---


finding the outlining data and filter it out as it may be the error while gathering the data.
Let's start by having the given data
```python
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()
```

In [97]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.024561    -0.001073    -0.068696     0.066352
std       1.006321     0.996045     0.997138     0.992765
min      -3.184377    -3.745356    -3.428254    -3.548824
25%      -0.641675    -0.642609    -0.774890    -0.596286
50%       0.001100    -0.013611    -0.117489     0.094503
75%       0.678010     0.654328     0.616366     0.780282
max       3.260383     3.927528     3.366626     2.653656

if we want to find the values in column 2 which the absolute value is exceeded 3
```python
col = data[2]
col[np.abs(col) >3]
```

In [98]:
col = data[2]
col[np.abs(col) >3]

519   -3.428254
896    3.366626
Name: 2, dtype: float64

If we want to get rows which value is exceeding  3, we can use `any` methods
```python
data[(np.abs(data)>3).any(1)]
```

In [99]:
data[(np.abs(data)>3).any(1)]

TypeError: NDFrame._add_numeric_operations.<locals>.any() takes 1 positional argument but 2 were given

#### Work
---

From the given property file.
Categorize the size of the hourse as the small house (size is less than 800 sq,ft.),  the medium house (size is between 801-1200 sq.ft) and the large house ( size is more than 1200 sq.ft)

Show the number of each house size

You should ignore the value which is not the number value

In [116]:
import pandas as pd

dat4 = pd.read_csv('file/property_data.csv')
dat4

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
1,100002000.0,197.0,LEXINGTON,N,3,1.5,--,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
7,100008000.0,213.0,TREMONT,Y,1,1,NaN,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

In [118]:
dat4_new = dat4.replace({'--':np.nan})

In [120]:
dat4_newmet = dat4_new.dropna(subset=['SQ_FT'])
dat4_newmet

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT,PRICE
0,100001000.0,104.0,PUTNAM,Y,3,1,1000,20000.0
2,100003000.0,NaN,LEXINGTON,N,NaN,1,850,NaN
3,100004000.0,201.0,BERKELEY,12,1,NaN,700,NaN
4,NaN,203.0,BERKELEY,Y,3,2,1600,NaN
5,100006000.0,207.0,BERKELEY,Y,NaN,1,800,NaN
6,100007000.0,NaN,WASHINGTON,NaN,2,HURLEY,950,NaN
8,100009000.0,215.0,TREMONT,Y,na,2,1800,NaN

In [121]:
bins = [0, 800, 1200, 2000]
group_name = ['small_house','medium house', 'large house']
sqft_array = np.array(dat4_newmet['SQ_FT'].astype(int))
sqft_array

array([1000,  850,  700, 1600,  800,  950, 1800])

In [122]:
cat = pd.cut(sqft_array,bins,labels=group_name)
pd.value_counts(cat)

medium house    3
small_house     2
large house     2
Name: count, dtype: int64

# Data Wrangling: Join, Combine, Reshape

## Hierachical Indexing
---


Allow index to have multiple index levels on an axis

Use when working with higher dimensional data ina lower dimensional form


๊Use this setup configuration

In [130]:
import numpy as np
import pandas as pd
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

create multiple index as given
```python
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data
```

In [131]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

We can see the index of the data
```python
data.index
```

In [132]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

we can see data in the multi level index to see only some index
```python
data['b']
```

In [133]:
data['b']

1   -0.555730
3    1.965781
dtype: float64

We can see data from the inner level
```python
data['b':'c']
```

In [134]:
data['b':'c']

b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
dtype: float64

The `loc` method can be used to select data from a particular group of rows and columns in the hierachical index
```python
data.loc[['b','d']]
```

In [135]:
data.loc[['b','d']]

b  1   -0.555730
   3    1.965781
d  2    0.281746
   3    0.769023
dtype: float64

We can see data from the inner level
```python
data.loc[:,2]
```

In [136]:
data.loc[:,2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

The slide can be also used
```python
data.loc[:,2]
```

In [137]:
data.loc[:,2]

a    0.478943
c    0.092908
d    0.281746
dtype: float64

Hierachical indexing play important role in reshaping data and group-based oepration.

The Hierachical index can be rearragen as the DataFrame using `unstack` methods
```python
data.unstack()
```

In [138]:
data.unstack()

          1         2         3
a -0.204708  0.478943 -0.519439
b -0.555730       NaN  1.965781
c  1.393406  0.092908       NaN
d       NaN  0.281746  0.769023

and the inverse version is `stack`
```python
data.unstack().stack()
```

In [139]:
data.unstack().stack()

a  1   -0.204708
   2    0.478943
   3   -0.519439
b  1   -0.555730
   3    1.965781
c  1    1.393406
   2    0.092908
d  2    0.281746
   3    0.769023
dtype: float64

As the data frame,  axis can have hierachical index
```python
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame
```

In [140]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

The Hierachy level can have names.
```python
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame
```

In [141]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### Work create this data frame

![image-20230907050812483](./assets/image-20230907050812483.png)

In [142]:

import pandas as pd

data = {
    'Province': ['Chiang Mai', 'Chiang Mai', 'Chiang Mai', 'Chiang Mai', 'Lampang', 'Lampang', 'Lampang', 'Bangkok', 'Bangkok', 'Bangkok'],
    'Subdistrict': ['Muang', 'Sansai', 'MaeRim', 'Hangdong', 'Jaehom', 'Muang', 'Maetha', 'Pathumwan', 'Samsen', 'Don muang'],
    'Income': [4473.00, 1597.00, 5013.00, 10236.00, 15818.00, 15063.00, 13777.00, 3730.00, 8395.00, 16054.00],
    'population': [32113.00, 28044.00, 46208.00, 30104.00, 40397.00, 44044.00, 84133.00, 13448.00, 74449.00, 58280.00]
}

df = pd.DataFrame(data)

print(df)

     Province Subdistrict   Income  population
0  Chiang Mai       Muang   4473.0     32113.0
1  Chiang Mai      Sansai   1597.0     28044.0
2  Chiang Mai      MaeRim   5013.0     46208.0
3  Chiang Mai    Hangdong  10236.0     30104.0
4     Lampang      Jaehom  15818.0     40397.0
5     Lampang       Muang  15063.0     44044.0
6     Lampang      Maetha  13777.0     84133.0
7     Bangkok   Pathumwan   3730.0     13448.0
8     Bangkok      Samsen   8395.0     74449.0
9     Bangkok   Don muang  16054.0     58280.0

In [143]:
data = {
    'Income': [4473.00, 1597.00, 5013.00, 10236.00, 15818.00, 15063.00, 13777.00, 3730.00, 8395.00, 16054.00],
    'Population': [32113.00, 28044.00, 46028.00, 30104.00, 43097.00, 44404.00, 84133.00, 13448.00, 74449.00, 58280.00]
}

frame2 = pd.DataFrame(data,
                      index=[['Chiang Mai','Chiang Mai','Chiang Mai','Chiang Mai', 'Lampang','Lampang','Lampang', 'Bangkok','Bangkok','Bangkok'], ['Muang','Sansai','Maerim','Hangdong','Jaehom','Muang','Maetha','Pathumwan','Samsen','Don Muang']])
frame2.index.names = ['Province', 'Subdistrict']
frame2

                         Income  Population
Province   Subdistrict
Chiang Mai Muang         4473.0     32113.0
           Sansai        1597.0     28044.0
           Maerim        5013.0     46028.0
           Hangdong     10236.0     30104.0
Lampang    Jaehom       15818.0     43097.0
           Muang        15063.0     44404.0
           Maetha       13777.0     84133.0
Bangkok    Pathumwan     3730.0     13448.0
           Samsen        8395.0     74449.0
           Don Muang    16054.0     58280.0

## Reordering and Sorting Levels
---

To transform data, we may have to swap the level of the data frame

The `swaplevel` method can be used to swap the level
```python
frame.swaplevel('key1','key2')
```

In [144]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

The index is not sort, so the multi hierachy is not set. we can sort the index at any level to set the better visualization
```python
frame.sort_index(level=1)
```

In [145]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

So swap the key and sort will make the hierarchy better
```python
frame.swaplevel(0,1).sort_index(level=0)
```

In [146]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

The `sort_index` method can be used to sort the index
```python
frame.swaplevel(0,1).sort_index(level=0)
```

In [147]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## Summary Statistics by Level
---

The statistic data can be calculated with the specific level
For example, if we want to calculate on the rows data

In [148]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

We can calculate the sum of the data by the level
```python
frame.sum()
```

In [149]:
frame.sum()

state     color
Ohio      Green    18
          Red      22
Colorado  Green    26
dtype: int64

then try
```python
frame.groupby(['key2']).sum()
```

In [150]:
frame.groupby(['key2']).sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

Or calculate on the column-wise
```python
frame.sum(axis=1)
```

In [151]:
frame.sum(axis=1)

key1  key2
a     1        3
      2       12
b     1       21
      2       30
dtype: int64

then try
```python
frame.groupby(['color'],axis=1).sum()
```

In [152]:
frame.groupby(['color'],axis=1).sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## Indexing with DataFrame's Column


some time we want to use the row index as the columns
```python
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame
```

In [153]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

We can create a new data frame using some columns as index

```python
frame2 = frame.set_index(['c','d'])
frame2
```

In [154]:
frame2 = frame.set_index(['c','d'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

By default, the column is removed from the source data frame. However, if we do not want to remove the column, the `drop` parameter is passed
```python
frame.set_index(['c','d'],drop = False)
```

In [155]:
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

### Work



From the given [./file/car_details.xlsx](./file/car_details.xlsx)

provided the hierarchy data frame which carbrand, carmodel, and the model_name TH is a key indexes

In [156]:
car = pd.read_excel('file/cardetails.xlsx',skiprows=1)
car

,serialNo,car_brand,car_model,model_name_th,nickname,item_name,fitment_detail,standard_price
0,IC-0000001,AUDI,Q5,คิว5,โฉมปี 2008-2016,ไส้กรองน้ำมันเครื่อง,-,NaN
1,IC-0000002,BMW,SERIES 5,ซีรี่ย์5,โฉมปี 2003-2010 (E60),ไส้กรองน้ำมันเครื่อง,-,NaN
2,IC-0000003,BMW,SERIES 5,ซีรี่ย์5,โฉมปี 2010-2017 (F10),ไส้กรองน้ำมันเครื่อง,-,NaN
3,JA-0000001,BMW,SERIES 5,ซีรี่ย์5,โฉมปี 2010-2017 (F10),ใบปัดน้ำฝน,-,NaN
4,IC-0000006,BMW,X1,เอ็กซ์1,โฉมปี 2009-2015 (E84),ไส้กรองน้ำมันเครื่อง,-,NaN
...,...,...,...,...,...,...,...,...
4724,NaN,TOYOTA,HILUX VIGO,ไฮลักซ์ วีโก้,โฉมปี 2003-2016 (Vigo 2WD),โช้คอัพ,หน้า,1250
4725,NaN,TOYOTA,HILUX VIGO,ไฮลักซ์ วีโก้,โฉมปี 2003-2016 (Vigo 2WD),โช้คอัพ,หน้า,1250
4726,NaN,TOYOTA,COROLLA ALTIS,โคโรล่า อัลติส,โฉมปี 2008-2012 (ZZE141),โช้คอัพ,หลัง,1440
4727,NaN,TOYOTA,HILUX REVO,ไฮลักซ์ รีโว่,โฉมปี 2016-2018 (Revo 4WD และ Pre-Runner ยกสูง),โช้คอัพ,หน้า,1580
4728,NaN,TOYOTA,FORTUNER,ฟอร์จูนเนอร์,โฉมปี 2015-2019 (KUN160),โช้คอัพ,หน้า,1580

Then try to find the average standard price for  each car brand, ignore the `NA` value

In [157]:
car2 = pd.read_excel('file/cardetails.xlsx',skiprows=1,thousands=',')
car3 = car.set_index(['car_brand', 'car_model', 'model_name_th'])
car3 = car2[car2['standard_price'].notnull()]
car3.head(20)

,serialNo,car_brand,car_model,model_name_th,nickname,item_name,fitment_detail,standard_price
6,AA-0000071,BMW,SERIES 3,ซีรี่ย์3,โฉมปี 1995-1998 (E36),ผ้าดิสเบรค,หลัง,1300.0
7,AA-0000139,BMW,SERIES 3,ซีรี่ย์3,โฉมปี 1995-1998 (E36),ผ้าดิสเบรค,หน้า,1300.0
8,AC-0000091,BMW,SERIES 3,ซีรี่ย์3,โฉมปี 1995-1998 (E36),จานดิสเบรค,หน้า,1300.0
9,AA-0000072,BMW,SERIES 3,ซีรี่ย์3,โฉมปี 1999-2006 (E46),ผ้าดิสเบรค,หลัง,1500.0
10,AA-0000129,BMW,SERIES 3,ซีรี่ย์3,โฉมปี 1999-2006 (E46),ผ้าดิสเบรค,หน้า,1600.0
12,AA-0000075,MERCEDES-BENZ,"E-CLASS , E200","อีคลาส, อี200",โฉมปี 2003-2009 (W211),ผ้าดิสเบรค,หน้า,1900.0
13,AL-0000003,MERCEDES-BENZ,"E-CLASS , E200","อีคลาส, อี200",โฉมปี 2003-2009 (W211),สายไฟเตือนผ้าเบรค,-,250.0
14,DF-0700316,MERCEDES-BENZ,"E-CLASS , E200","อีคลาส, อี200",โฉมปี 2003-2009 (W211),ลูกหมากกันโคลง,หน้า,850.0
16,AL-0000004,MERCEDES-BENZ,"E-CLASS, E200","อีคลาส, อี200",โฉมปี 2010-2016 (W212),สายไฟเตือนผ้าเบรค,-,250.0
17,AA-0000068,MERCEDES-BENZ,"E-CLASS, E200","อีคลาส, อี200",โฉมปี 2010-2016 (W212),ผ้าดิสเบรค,-,1800.0
18,AA-0000070,MERCEDES-BENZ,"E-CLASS, E200","อีคลาส, อี200",โฉมปี 2010-2016 (W212),ผ้าดิสเบรค,หน้า,1650.0
19,AA-0000069,MERCEDES-BENZ,"E-CLASS, E200","อีคลาส, อี200",โฉมปี 2010-2016 (W212),ผ้าดิสเบรค,หลัง,1100.0
22,AL-0000001,MERCEDES-BENZ,CLA250,ซีแอลเอ250,โฉมปี 2013-ปัจจุบัน,สายไฟเตือนผ้าเบรค,-,400.0
23,AA-0000007,MERCEDES-BENZ,CLA250,ซีแอลเอ250,โฉมปี 2013-ปัจจุบัน,ผ้าดิสเบรค,หน้า,3400.0
24,AA-0000003,MERCEDES-BENZ,CLA250,ซีแอลเอ250,โฉมปี 2013-ปัจจุบัน,ผ้าดิสเบรค,หลัง,3400.0
25,AC-0000002,MERCEDES-BENZ,CLA250,ซีแอลเอ250,โฉมปี 2013-ปัจจุบัน,จานดิสเบรค,หน้า,5800.0
26,AC-0000001,MERCEDES-BENZ,CLA250,ซีแอลเอ250,โฉมปี 2013-ปัจจุบัน,จานดิสเบรค,หลัง,3300.0
28,AA-0000006,MERCEDES-BENZ,"C-CLASS, C180","ซีคลาส, ซี180",โฉมปี 2000-2007 (W203),ผ้าดิสเบรค,หน้า,3400.0
30,EB-0300001,MERCEDES-BENZ,"C-CLASS, C180","ซีคลาส, ซี180",โฉมปี 2000-2007 (W203),คอน้ำ,-,700.0
31,Z-03500001,MERCEDES-BENZ,"C-CLASS, C180","ซีคลาส, ซี180",โฉมปี 2000-2007 (W203),สายไฟเตือนเบรค,-,250.0

In [158]:
car4 = car3['standard_price'].groupby(['car_brand']).mean()
car4

KeyError: 'car_brand'